In [1]:
import pandas as pd

In [2]:
# df = pd.read_csv('DANIELS_data_engineering_dataset.csv')
# df.head()

In [3]:
import sqlite3
conn = sqlite3.connect('cars.db')
c = conn.cursor()

In [4]:
c.execute('''SELECT *
            FROM Dim_Product
            ;''')

df_Dim_Product = pd.DataFrame(c.fetchall())
df_Dim_Product.columns = [x[0] for x in c.description]

df_Dim_Product.head()

                 VIN  VIN_ID
0  1G1AL15F777226903       1
1  5NPEU46C66H126152       2
2  3MEHM08Z48R665374       3
3  1HGCP2F81AA000524       4
4  2G2WC52C951325364       5

In [5]:
c.execute('''SELECT *
            FROM Dim_Stores
            ;''')

df_Dim_Stores = pd.DataFrame(c.fetchall())
df_Dim_Stores.columns = [x[0] for x in c.description]

df_Dim_Stores.head()

   Store_ID SaleLoc
0         1      86
1         2     189
2         3     360
3         4     302
4         5     295

In [17]:
c.execute('''SELECT *
            FROM Fact_Sales
            ;''')

df_Fact_Sales = pd.DataFrame(c.fetchall())
df_Fact_Sales.columns = [x[0] for x in c.description]

df_Fact_Sales

       Store_ID  VIN_ID PurchVal
0           1.0     NaN     None
1           2.0     NaN     None
2           3.0     NaN     None
3           4.0     NaN     None
4           5.0     NaN     None
...         ...     ...      ...
68359       NaN     NaN     3800
68360       NaN     NaN     4800
68361       NaN     NaN     5740
68362       NaN     NaN     4400
68363       NaN     NaN     5500

[68364 rows x 3 columns]

In [18]:
c.execute('''SELECT *
            FROM Fact_Sales
            ORDER BY Store_ID ASC
            LIMIT 100
            ;''')


df_Fact_Sales = pd.DataFrame(c.fetchall())
df_Fact_Sales.columns = [x[0] for x in c.description]

df_Fact_Sales

   Store_ID  VIN_ID PurchVal
0      None       1     None
1      None       2     None
2      None       3     None
3      None       4     None
4      None       5     None
..      ...     ...      ...
95     None      96     None
96     None      97     None
97     None      98     None
98     None      99     None
99     None     100     None

[100 rows x 3 columns]

In [26]:
df_Fact_Sales['Store_ID'][23]

In [23]:
df_Fact_Sales['PurchVal'][0]

In [24]:
type(df_Fact_Sales['PurchVal'][0])

NoneType

In [22]:
type(df_Fact_Sales['Store_ID'][0])

NoneType

In [11]:
type(df_Dim_Stores['Store_ID'][80])

numpy.int64

In [12]:
df_Dim_Stores['Store_ID'][99]

100

In [13]:
type(df_Dim_Product['VIN_ID'][0])

numpy.int64

In [14]:
df_Dim_Product['VIN_ID'][990]

991

In [26]:
c.execute('''SELECT *
            FROM sqlite_master
            WHERE TYPE = 'table'
            ORDER BY name;''').fetchall()

[('table',
  'Dim_Product',
  'Dim_Product',
  816,
  'CREATE TABLE Dim_Product (VIN TEXT, VIN_ID INTEGER PRIMARY KEY AUTOINCREMENT)'),
 ('table',
  'Dim_Stores',
  'Dim_Stores',
  2,
  'CREATE TABLE Dim_Stores (Store_ID INTEGER PRIMARY KEY AUTOINCREMENT, SaleLoc INTEGER)'),
 ('table',
  'Fact_Sales',
  'Fact_Sales',
  814,
  'CREATE TABLE Fact_Sales (Store_ID REFERENCES Dim_Stores (Store_ID), VIN_ID REFERENCES Dim_Product (VIN_ID), PurchVal INTEGER)'),
 ('table',
  'Sales',
  'Sales',
  3,
  'CREATE TABLE Sales (VIN TEXT, CarYear INTEGER, Color TEXT, VehBody TEXT, EngineType TEXT, Make TEXT, Miles INTEGER, Odometer INTEGER, Brand TEXT, VehType TEXT, LocationNum INTEGER, CarType TEXT, EngineLiters TEXT, FuelType TEXT, Transmission TEXT, SaleLoc INTEGER, PurchVal INT)'),
 ('table',
  'sqlite_sequence',
  'sqlite_sequence',
  868,
  'CREATE TABLE sqlite_sequence(name,seq)')]